---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.#ctor(Autodesk.Revit.DB.PointClouds.PointCloudColorSettings)
source: html/4e4cfb85-6c2d-fbfd-2bb8-e6a6efcab2cd.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.#ctor Method

Constructs a copy of source object.

## Syntax (C#)
```csharp
public PointCloudColorSettings(
	PointCloudColorSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.PointClouds.PointCloudColorSettings`) - Source object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null